app/views/articles/show.html.erb


<% unless @article.comments.empty? %>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`article_id` = 1