app/controllers/admin_controller.rb

  def index
    @total_orders = Order.count
---
SELECT COUNT(*) FROM `orders`