app/controllers/events_controller.rb

INSERT INTO `events` (`capacity`, `created_at`, `description`, `is_public`, `name`, `status`, `updated_at`) VALUES (NULL, '2012-05-09 08:52:05', 'the description is too short', NULL, 'songhailin', NULL, '2012-05-09 08:52:05')
---
  def create
    @event = Event.new(params[:event])
    if @event.save

UPDATE `events` SET `description` = '', `updated_at` = '2012-05-09 09:18:37' WHERE `events`.`id` = 2
---
  def update
    if @event.update_attributes(params[:event])

DELETE FROM `events` WHERE `events`.`id` = 5
---
  def destroy
    @event.destroy

SELECT `events`.* FROM `events` WHERE `events`.`id` = 5 LIMIT 1
---
  def find_event
    @event = Event.find(params[:id])