app/controllers/store_controller.rb

  def index
    @products = Product.find_products_by_sale
---
SELECT `products`.* FROM `products` ORDER BY title

  def add_to_cart
    product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = ? LIMIT 1  [["id", "11"]]

  def save_order
#    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`created_at`, `order_id`, `product_id`, `quantity`, `total_price`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 09 Jul 2012 09:22:54 UTC +00:00], ["order_id", 1], ["product_id", 11], ["quantity", 1], ["total_price", 0], ["updated_at", Mon, 09 Jul 2012 09:22:54 UTC +00:00]]
INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)