app/controllers/users_controller.rb

  def index
    @users = User.find(:all,:order=>:name)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `hashed_password`, `name`, `salt`, `updated_at`) VALUES (?, ?, ?, ?, ?)

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = ?  [["id", 4]]